# Final Project

### Import Dependencies and CSV's

In [42]:
import pandas as pd
import pandas as pd
import numpy as np
import re
from sqlalchemy import create_engine
import psycopg2
from config import db_password
import time

In [43]:
var_serv_df = pd.read_csv("var_service_FINAL_PROJECT.csv")
pd.set_option('max_columns', None)
#var_serv_df

In [44]:
var_cust_df = pd.read_csv("var_cust_Final_Project.csv")
# var_cust_df

### Cleanup Variable Customer DataFrame

In [45]:
# Get rid of unnecessary columns
var_cust_short = var_cust_df.filter(['CUST#', 'TAX BODY', 'CYCLE', 'MTH$'])
var_cust_short

        CUST# TAX BODY CYCLE    MTH$
0          82   S         TA    0.00
1          98   C         CA  888.98
2         218   SC        CA  965.40
3         345   SC        CA  890.40
4         369   SC        CA   44.86
...       ...      ...   ...     ...
1051    60891   AC        CA  147.63
1052    61031   C         CA  311.79
1053    61096   PV        CA  174.80
1054    61706   CC        CA  482.56
1055  9999999   S         CM    0.00

[1056 rows x 4 columns]

In [46]:
# Get list of values in Cycle column
var_cust_short.CYCLE.unique()

array(['TA', 'CA', 'PA', 'MA', 'CN', 'TN', 'CM'], dtype=object)

In [47]:
# Get rid of cycles that I won't be using (internal accounts or temporary services)
var_cust_com = var_cust_short[(var_cust_short['CYCLE'].isin(['CA', 'PA', 'MA', 'CN']))].reset_index(drop=True)
var_cust_com

     CUST# TAX BODY CYCLE    MTH$
0       98   C         CA  888.98
1      218   SC        CA  965.40
2      345   SC        CA  890.40
3      369   SC        CA   44.86
4      567   S         CA   97.87
..     ...      ...   ...     ...
932  60815   C         CA  207.86
933  60891   AC        CA  147.63
934  61031   C         CA  311.79
935  61096   PV        CA  174.80
936  61706   CC        CA  482.56

[937 rows x 4 columns]

In [48]:
# Change column names so it can load into postgreSQL
var_cust_com = var_cust_com.rename(columns={"CUST#": "cust", "TAX BODY": "tax_body", "CYCLE": "cycle", "MTH$": "monthly_bill"})
var_cust_com

      cust tax_body cycle  monthly_bill
0       98   C         CA        888.98
1      218   SC        CA        965.40
2      345   SC        CA        890.40
3      369   SC        CA         44.86
4      567   S         CA         97.87
..     ...      ...   ...           ...
932  60815   C         CA        207.86
933  60891   AC        CA        147.63
934  61031   C         CA        311.79
935  61096   PV        CA        174.80
936  61706   CC        CA        482.56

[937 rows x 4 columns]

In [49]:
# # Change the index so it is easier to merge
merg_var_cust_com =var_cust_com.set_index('cust')
merg_var_cust_com

      tax_body cycle  monthly_bill
cust
98      C         CA        888.98
218     SC        CA        965.40
345     SC        CA        890.40
369     SC        CA         44.86
567     S         CA         97.87
...        ...   ...           ...
60815   C         CA        207.86
60891   AC        CA        147.63
61031   C         CA        311.79
61096   PV        CA        174.80
61706   CC        CA        482.56

[937 rows x 3 columns]

In [50]:
# Replace all _C & PV values with 'COUNTY' AND CL with C in TAX BODY column
# merg_var_cust_com.TAX_BODY.values
merg_var_cust_com.replace({'tax_body': {'SC    ':'COUNTY', 'AC    ': 'COUNTY', 'YC    ': 'COUNTY', 'CC    ': 'COUNTY', 'PV    ': 'COUNTY', 'CL    ': 'C', 'C      ': 'C', 'S     ': 'S', 'Y     ': 'Y'}}, inplace=True)
merg_var_cust_com.head(30)

     tax_body cycle  monthly_bill
cust
98     C         CA        888.98
218    COUNTY    CA        965.40
345    COUNTY    CA        890.40
369    COUNTY    CA         44.86
567         S    CA         97.87
717         S    CA         65.25
767    COUNTY    CA         89.71
800    COUNTY    CA        706.50
806    COUNTY    CA        597.92
939         S    CA        195.74
948    C         CA        842.69
1084   COUNTY    CA       1835.23
1092   COUNTY    CA       1373.25
1454   COUNTY    CA        452.18
1575   COUNTY    CA        760.91
1742   COUNTY    CA         44.86
1767        S    CA        363.91
1824   COUNTY    CA        684.42
2064   COUNTY    CA       1693.50
2226   COUNTY    CA          0.00
2253        S    CA         97.87
2339   COUNTY    CA       1522.96
2342   COUNTY    CA        487.05
2372   COUNTY    CA        199.35
2642   COUNTY    CA          0.00
2678        S    CA        293.61
2754        C    CA       1227.47
2810        Y    CA         67.49
3159   COUNTY    CA         89.71
3630   COUNTY    CA        134.57

In [51]:
# Drop Cycle
merg_var_cust_com.drop(columns=['cycle'],inplace=True)
merg_var_cust_com

      tax_body  monthly_bill
cust
98      C             888.98
218     COUNTY        965.40
345     COUNTY        890.40
369     COUNTY         44.86
567          S         97.87
...        ...           ...
60815   C             207.86
60891   COUNTY        147.63
61031   C             311.79
61096   COUNTY        174.80
61706   COUNTY        482.56

[937 rows x 2 columns]

### Cleanup Variable Service DataFrame

In [140]:
# Grab only the necessary columns
var_serv_short = var_serv_df.filter(['CUST #','CYCLE', 'QTY', 'SIZE', 'CHG CODE', 'BIN#', 'P/U#', 'BIN AMT$', 'TAX BODY', 'VAR3'], axis=1)
var_serv_short

      CUST # CYCLE  QTY SIZE CHG CODE  P/U#  BIN AMT$ TAX BODY       VAR3
0         98    CA    1   4Y       T0     1    813.98        C  MINI MART
1         98    CA    1   4Y       CB     2     75.00        C  MINI MART
2         98    CA    1   4Y       CB     2     75.00        C  MINI MART
3        218    CA    1   4Y       CB     1     75.00       SC     WINERY
4        218    CA    1   4Y       T0     1    890.40       SC     WINERY
...      ...   ...  ...  ...      ...   ...       ...      ...        ...
3684   61031    CA    3   96       CR     1      0.00        C        NaN
3685   61096    CA    1   CT       09     1    174.80       PV        NaN
3686   61096    CA    1   96       CR     1      0.00       PV        NaN
3687   61706    CA    1   2Y       T0     1    482.56       CC        NaN
3688   61706    CA    3   96       CR     1      0.00       CC        NaN

[3689 rows x 9 columns]

In [141]:
# Get list of values in Cycle column
var_serv_short.CYCLE.unique()

array(['CA', 'TA', 'PA', 'MA', 'CN', 'TN'], dtype=object)

In [142]:
# Get rid of cycles that I won't be using
var_serv_com = var_serv_short[(var_serv_short['CYCLE'].isin(['CA']))]
var_serv_com

      CUST # CYCLE  QTY SIZE CHG CODE  P/U#  BIN AMT$ TAX BODY       VAR3
0         98    CA    1   4Y       T0     1    813.98        C  MINI MART
1         98    CA    1   4Y       CB     2     75.00        C  MINI MART
2         98    CA    1   4Y       CB     2     75.00        C  MINI MART
3        218    CA    1   4Y       CB     1     75.00       SC     WINERY
4        218    CA    1   4Y       T0     1    890.40       SC     WINERY
...      ...   ...  ...  ...      ...   ...       ...      ...        ...
3684   61031    CA    3   96       CR     1      0.00        C        NaN
3685   61096    CA    1   CT       09     1    174.80       PV        NaN
3686   61096    CA    1   96       CR     1      0.00       PV        NaN
3687   61706    CA    1   2Y       T0     1    482.56       CC        NaN
3688   61706    CA    3   96       CR     1      0.00       CC        NaN

[3286 rows x 9 columns]

In [143]:
# # Drop rows where business type (VAR3) is null
# var_serv_com = var_serv_com[var_serv_com['VAR3'].notna()].reset_index(drop=True)
# var_serv_com

In [144]:
# Change column names so it can load into postgreSQL
var_serv_com = var_serv_com.rename(columns={"CUST #": "cust", "CYCLE":"cycle", "QTY": "qty", "SIZE": "size", "CHG CODE": "chg", "P/U#": "pickups", "BIN AMT$": "bin_amount", "TAX BODY": "tax_body", "VAR3":"biz_type"})
var_serv_com

       cust cycle  qty size chg  pickups  bin_amount tax_body   biz_type
0        98    CA    1   4Y  T0        1      813.98        C  MINI MART
1        98    CA    1   4Y  CB        2       75.00        C  MINI MART
2        98    CA    1   4Y  CB        2       75.00        C  MINI MART
3       218    CA    1   4Y  CB        1       75.00       SC     WINERY
4       218    CA    1   4Y  T0        1      890.40       SC     WINERY
...     ...   ...  ...  ...  ..      ...         ...      ...        ...
3684  61031    CA    3   96  CR        1        0.00        C        NaN
3685  61096    CA    1   CT  09        1      174.80       PV        NaN
3686  61096    CA    1   96  CR        1        0.00       PV        NaN
3687  61706    CA    1   2Y  T0        1      482.56       CC        NaN
3688  61706    CA    3   96  CR        1        0.00       CC        NaN

[3286 rows x 9 columns]

In [145]:
# # Change the index so it is easier to merge
merg_var_serv_com =var_serv_com.set_index('cust')
merg_var_serv_com

      cycle  qty size chg  pickups  bin_amount tax_body   biz_type
cust
98       CA    1   4Y  T0        1      813.98        C  MINI MART
98       CA    1   4Y  CB        2       75.00        C  MINI MART
98       CA    1   4Y  CB        2       75.00        C  MINI MART
218      CA    1   4Y  CB        1       75.00       SC     WINERY
218      CA    1   4Y  T0        1      890.40       SC     WINERY
...     ...  ...  ...  ..      ...         ...      ...        ...
61031    CA    3   96  CR        1        0.00        C        NaN
61096    CA    1   CT  09        1      174.80       PV        NaN
61096    CA    1   96  CR        1        0.00       PV        NaN
61706    CA    1   2Y  T0        1      482.56       CC        NaN
61706    CA    3   96  CR        1        0.00       CC        NaN

[3286 rows x 8 columns]

In [146]:
# Drop cycle
merg_var_serv_com.drop(columns=['cycle'], inplace=True)
merg_var_serv_com

       qty size chg  pickups  bin_amount tax_body   biz_type
cust
98       1   4Y  T0        1      813.98        C  MINI MART
98       1   4Y  CB        2       75.00        C  MINI MART
98       1   4Y  CB        2       75.00        C  MINI MART
218      1   4Y  CB        1       75.00       SC     WINERY
218      1   4Y  T0        1      890.40       SC     WINERY
...    ...  ...  ..      ...         ...      ...        ...
61031    3   96  CR        1        0.00        C        NaN
61096    1   CT  09        1      174.80       PV        NaN
61096    1   96  CR        1        0.00       PV        NaN
61706    1   2Y  T0        1      482.56       CC        NaN
61706    3   96  CR        1        0.00       CC        NaN

[3286 rows x 7 columns]

In [147]:
# Replace all _C & PV values with 'COUNTY' AND CL with C in TAX BODY column
merg_var_serv_com.replace({'tax_body': {'SC':'COUNTY', 'AC': 'COUNTY', 'YC': 'COUNTY', 'CC': 'COUNTY', 'PV': 'COUNTY', 'CL': 'C'}}, inplace=True)
merg_var_serv_com

       qty size chg  pickups  bin_amount tax_body   biz_type
cust
98       1   4Y  T0        1      813.98        C  MINI MART
98       1   4Y  CB        2       75.00        C  MINI MART
98       1   4Y  CB        2       75.00        C  MINI MART
218      1   4Y  CB        1       75.00   COUNTY     WINERY
218      1   4Y  T0        1      890.40   COUNTY     WINERY
...    ...  ...  ..      ...         ...      ...        ...
61031    3   96  CR        1        0.00        C        NaN
61096    1   CT  09        1      174.80   COUNTY        NaN
61096    1   96  CR        1        0.00   COUNTY        NaN
61706    1   2Y  T0        1      482.56   COUNTY        NaN
61706    3   96  CR        1        0.00   COUNTY        NaN

[3286 rows x 7 columns]

In [148]:
# Prepping data for machine learning
# Create column for commodity type (garbage, recycle, or compost)
merg_var_serv_com.insert(4, "commodity", "")
# Convert easy size codes (dumpsters)
# *NOTE* All sizes will be in cubic yards, so gallon values are changed to cubic yards
merg_var_serv_com.replace({'1Y': 1, '2Y': 2, '3Y': 3.5,'4Y': 4, '4P': 4, '6Y': 6, '35': .16, '96': .48}, inplace=True)
merg_var_serv_com

       qty  size chg  pickups commodity  bin_amount tax_body   biz_type
cust
98       1     4  T0        1                813.98        C  MINI MART
98       1     4  CB        2                 75.00        C  MINI MART
98       1     4  CB        2                 75.00        C  MINI MART
218      1     4  CB        1                 75.00   COUNTY     WINERY
218      1     4  T0        1                890.40   COUNTY     WINERY
...    ...   ...  ..      ...       ...         ...      ...        ...
61031    3  0.48  CR        1                  0.00        C        NaN
61096    1    CT  09        1                174.80   COUNTY        NaN
61096    1  0.48  CR        1                  0.00   COUNTY        NaN
61706    1     2  T0        1                482.56   COUNTY        NaN
61706    3  0.48  CR        1                  0.00   COUNTY        NaN

[3286 rows x 8 columns]

## Additional cleaning and prepping for Machine learning

In [149]:
merg_var_serv_com.dtypes

qty             int64
size           object
chg            object
pickups         int64
commodity      object
bin_amount    float64
tax_body       object
biz_type       object
dtype: object

In [150]:
# Replace size codes and commodity based on relationship between size and chg codes and commodity based on size
# Food Waste (will also be labeled as compost)
merg_var_serv_com.loc[merg_var_serv_com['size'] == 'CF', 'commodity'] = 'Compost'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'D3', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == 'D6', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == 'D7', 'size'] = .32

# # Garbage
merg_var_serv_com.loc[merg_var_serv_com['size'] == 'CT', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'SA', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'TH', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'T0', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'T1', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'T2', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'T3', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'T4', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'OP', 'commodity'] = 'Garbage'

merg_var_serv_com.loc[merg_var_serv_com.chg == '03', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '03', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '13', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '23', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '33', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '43', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '53', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '63', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '73', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '83', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '93', 'size'] = .16
merg_var_serv_com.loc[merg_var_serv_com.chg == '06', 'size'] = .32 # Also used for food waste
merg_var_serv_com.loc[merg_var_serv_com.chg == '16', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '26', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '36', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '46', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '56', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '66', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '76', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '86', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '96', 'size'] = .32
merg_var_serv_com.loc[merg_var_serv_com.chg == '09', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '19', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '29', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '39', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '49', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '59', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '69', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '79', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '89', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == '99', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == 'C0', 'commodity'] = 'Garbage'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'C0', 'size'] = 4 # C0 is a compactor, so a 2:1 compaction rate puts a 2yd at 4

# # Compost
merg_var_serv_com.loc[merg_var_serv_com.chg == '0G', 'commodity'] = 'Compost'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'AG', 'commodity'] = 'Compost'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'CG', 'commodity'] = 'Compost'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'G0', 'commodity'] = 'Compost'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'G2', 'commodity'] = 'Compost'

merg_var_serv_com.loc[merg_var_serv_com.chg == '0G', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == 'AG', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == 'CG', 'size'] = .48

# #Recycle
merg_var_serv_com.loc[merg_var_serv_com.chg == 'JP', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'GL', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'CB', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'R0', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'R1', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'R2', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'R3', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'R4', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'RH', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == '0R', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'CR', 'commodity'] = 'Recycle'
merg_var_serv_com.loc[merg_var_serv_com.chg == 'AR', 'commodity'] = 'Recycle'

merg_var_serv_com.loc[merg_var_serv_com.chg == '0R', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == 'CR', 'size'] = .48
merg_var_serv_com.loc[merg_var_serv_com.chg == 'AR', 'size'] = .48
merg_var_serv_com

       qty  size chg  pickups commodity  bin_amount tax_body   biz_type
cust
98       1     4  T0        1   Garbage      813.98        C  MINI MART
98       1     4  CB        2   Recycle       75.00        C  MINI MART
98       1     4  CB        2   Recycle       75.00        C  MINI MART
218      1     4  CB        1   Recycle       75.00   COUNTY     WINERY
218      1     4  T0        1   Garbage      890.40   COUNTY     WINERY
...    ...   ...  ..      ...       ...         ...      ...        ...
61031    3  0.48  CR        1   Recycle        0.00        C        NaN
61096    1  0.48  09        1   Garbage      174.80   COUNTY        NaN
61096    1  0.48  CR        1   Recycle        0.00   COUNTY        NaN
61706    1     2  T0        1   Garbage      482.56   COUNTY        NaN
61706    3  0.48  CR        1   Recycle        0.00   COUNTY        NaN

[3286 rows x 8 columns]

In [151]:
# Drop chg code column
merg_var_serv_com.drop(columns=['chg'], inplace=True)
merg_var_serv_com

       qty  size  pickups commodity  bin_amount tax_body   biz_type
cust
98       1     4        1   Garbage      813.98        C  MINI MART
98       1     4        2   Recycle       75.00        C  MINI MART
98       1     4        2   Recycle       75.00        C  MINI MART
218      1     4        1   Recycle       75.00   COUNTY     WINERY
218      1     4        1   Garbage      890.40   COUNTY     WINERY
...    ...   ...      ...       ...         ...      ...        ...
61031    3  0.48        1   Recycle        0.00        C        NaN
61096    1  0.48        1   Garbage      174.80   COUNTY        NaN
61096    1  0.48        1   Recycle        0.00   COUNTY        NaN
61706    1     2        1   Garbage      482.56   COUNTY        NaN
61706    3  0.48        1   Recycle        0.00   COUNTY        NaN

[3286 rows x 7 columns]

In [152]:
# Drop rows with null values in commodity
merg_var_serv_com['commodity'].replace('', np.nan, inplace=True)
merg_var_serv_com.dropna(subset=['commodity'], inplace=True)
merg_var_serv_com

       qty  size  pickups commodity  bin_amount tax_body   biz_type
cust
98       1     4        1   Garbage      813.98        C  MINI MART
98       1     4        2   Recycle       75.00        C  MINI MART
98       1     4        2   Recycle       75.00        C  MINI MART
218      1     4        1   Recycle       75.00   COUNTY     WINERY
218      1     4        1   Garbage      890.40   COUNTY     WINERY
...    ...   ...      ...       ...         ...      ...        ...
61031    3  0.48        1   Recycle        0.00        C        NaN
61096    1  0.48        1   Garbage      174.80   COUNTY        NaN
61096    1  0.48        1   Recycle        0.00   COUNTY        NaN
61706    1     2        1   Garbage      482.56   COUNTY        NaN
61706    3  0.48        1   Recycle        0.00   COUNTY        NaN

[3202 rows x 7 columns]

In [153]:
# # Drop duplicate rows
# merg_var_serv_com.drop_duplicates(inplace=True)
# merg_var_serv_com

In [154]:
# Add column for weekly yards of service
merg_var_serv_com.insert(3, "weekly_yards", "")
merg_var_serv_com

,qty,size,pickups,weekly_yards,commodity,bin_amount,tax_body,biz_type
cust,,,,,,,,
98,1,4,1,,Garbage,813.98,C,MINI MART
98,1,4,2,,Recycle,75.00,C,MINI MART
98,1,4,2,,Recycle,75.00,C,MINI MART
218,1,4,1,,Recycle,75.00,COUNTY,WINERY
218,1,4,1,,Garbage,890.40,COUNTY,WINERY
...,...,...,...,...,...,...,...,...
61031,3,0.48,1,,Recycle,0.00,C,NaN
61096,1,0.48,1,,Garbage,174.80,COUNTY,NaN
61096,1,0.48,1,,Recycle,0.00,COUNTY,NaN
61706,1,2,1,,Garbage,482.56,COUNTY,NaN
61706,3,0.48,1,,Recycle,0.00,COUNTY,NaN

In [155]:
# Multiply qty, size, and pickups to get weekly yards of service
merg_var_serv_com['weekly_yards'] = merg_var_serv_com['qty']*merg_var_serv_com['size']*merg_var_serv_com['pickups']
merg_var_serv_com

,qty,size,pickups,weekly_yards,commodity,bin_amount,tax_body,biz_type
cust,,,,,,,,
98,1,4,1,4,Garbage,813.98,C,MINI MART
98,1,4,2,8,Recycle,75.00,C,MINI MART
98,1,4,2,8,Recycle,75.00,C,MINI MART
218,1,4,1,4,Recycle,75.00,COUNTY,WINERY
218,1,4,1,4,Garbage,890.40,COUNTY,WINERY
...,...,...,...,...,...,...,...,...
61031,3,0.48,1,1.44,Recycle,0.00,C,NaN
61096,1,0.48,1,0.48,Garbage,174.80,COUNTY,NaN
61096,1,0.48,1,0.48,Recycle,0.00,COUNTY,NaN
61706,1,2,1,2,Garbage,482.56,COUNTY,NaN
61706,3,0.48,1,1.44,Recycle,0.00,COUNTY,NaN

In [158]:
# create new df without qty, size, or pickups
just_yards = merg_var_serv_com[['weekly_yards', 'commodity', 'bin_amount', 'tax_body', 'biz_type']].copy()
just_yards

      weekly_yards commodity  bin_amount tax_body   biz_type
cust
98               4   Garbage      813.98        C  MINI MART
98               8   Recycle       75.00        C  MINI MART
98               8   Recycle       75.00        C  MINI MART
218              4   Recycle       75.00   COUNTY     WINERY
218              4   Garbage      890.40   COUNTY     WINERY
...            ...       ...         ...      ...        ...
61031         1.44   Recycle        0.00        C        NaN
61096         0.48   Garbage      174.80   COUNTY        NaN
61096         0.48   Recycle        0.00   COUNTY        NaN
61706            2   Garbage      482.56   COUNTY        NaN
61706         1.44   Recycle        0.00   COUNTY        NaN

[3202 rows x 5 columns]

In [159]:
# Pivot df to have whether the customer has recycling or compost service
serv_df = just_yards.reset_index()
serv_pivot = pd.pivot_table(just_yards, values='weekly_yards', index=['cust','biz_type'], columns= ['commodity'], aggfunc=np.sum, fill_value=0)
serv_pivot

commodity         Compost  Garbage  Recycle
cust  biz_type
98    MINI MART      0.00     4.00    16.00
218   WINERY         0.48     4.00     5.44
345   WINERY         0.00     4.00     0.00
567   MEDICAL        0.00     0.48     0.48
717   GROCERY        0.00     0.32     0.48
...                   ...      ...      ...
31644 MULTIFAMIL     0.96     0.96     0.96
31660 MIXED USE      0.48     0.48     0.48
31675 LODGING-FW     0.48     0.48     0.48
31676 WINERY         0.00     2.00     6.00
31679 WINERY         0.00     0.32     0.48

[439 rows x 3 columns]

In [160]:
# Insert "Do they recycle/compost?" Columns
# serv_pivot.insert(3,"do_they_recycle", "")
# serv_pivot.insert(4,"do_they_compost", "")
# serv_pivot

In [161]:
# # Create if then statement to fill columns
# serv_pivot['do_they_recycle'] = np.where(serv_pivot['Recycle'] > 0, "Yes", "No")
# serv_pivot['do_they_compost'] = np.where(serv_pivot['Compost'] > 0, "Yes", "No")
# serv_pivot

In [162]:
# Insert how much recycle or compost should they have columns
# *NOTE* If they a value already, it will stay that value. If they don't have a value already, the value will be 'NaN'
serv_pivot.insert(3,"needed_recycle", "")
serv_pivot.insert(4,"needed_compost", "")
serv_pivot

commodity         Compost  Garbage  Recycle needed_recycle needed_compost
cust  biz_type
98    MINI MART      0.00     4.00    16.00
218   WINERY         0.48     4.00     5.44
345   WINERY         0.00     4.00     0.00
567   MEDICAL        0.00     0.48     0.48
717   GROCERY        0.00     0.32     0.48
...                   ...      ...      ...            ...            ...
31644 MULTIFAMIL     0.96     0.96     0.96
31660 MIXED USE      0.48     0.48     0.48
31675 LODGING-FW     0.48     0.48     0.48
31676 WINERY         0.00     2.00     6.00
31679 WINERY         0.00     0.32     0.48

[439 rows x 5 columns]

In [163]:
# fill columns
serv_pivot['needed_recycle'] = np.where(serv_pivot['Recycle'] > 0, serv_pivot['Recycle'], np.nan )
serv_pivot['needed_compost'] = np.where(serv_pivot['Compost'] > 0, serv_pivot['Compost'], np.nan )
serv_pivot

commodity         Compost  Garbage  Recycle  needed_recycle  needed_compost
cust  biz_type
98    MINI MART      0.00     4.00    16.00           16.00             NaN
218   WINERY         0.48     4.00     5.44            5.44            0.48
345   WINERY         0.00     4.00     0.00             NaN             NaN
567   MEDICAL        0.00     0.48     0.48            0.48             NaN
717   GROCERY        0.00     0.32     0.48            0.48             NaN
...                   ...      ...      ...             ...             ...
31644 MULTIFAMIL     0.96     0.96     0.96            0.96            0.96
31660 MIXED USE      0.48     0.48     0.48            0.48            0.48
31675 LODGING-FW     0.48     0.48     0.48            0.48            0.48
31676 WINERY         0.00     2.00     6.00            6.00             NaN
31679 WINERY         0.00     0.32     0.48            0.48             NaN

[439 rows x 5 columns]

In [164]:
# Insert how much recycle or compost should they have columns
serv_pivot.insert(3,"total_yards", "")
serv_pivot

,commodity,Compost,Garbage,Recycle,total_yards,needed_recycle,needed_compost
cust,biz_type,,,,,,
98,MINI MART,0.00,4.00,16.00,,16.00,NaN
218,WINERY,0.48,4.00,5.44,,5.44,0.48
345,WINERY,0.00,4.00,0.00,,NaN,NaN
567,MEDICAL,0.00,0.48,0.48,,0.48,NaN
717,GROCERY,0.00,0.32,0.48,,0.48,NaN
...,...,...,...,...,...,...,...
31644,MULTIFAMIL,0.96,0.96,0.96,,0.96,0.96
31660,MIXED USE,0.48,0.48,0.48,,0.48,0.48
31675,LODGING-FW,0.48,0.48,0.48,,0.48,0.48
31676,WINERY,0.00,2.00,6.00,,6.00,NaN
31679,WINERY,0.00,0.32,0.48,,0.48,NaN

In [165]:
# fill columns
serv_pivot['total_yards'] = serv_pivot['Compost']+ serv_pivot['Garbage']+ serv_pivot['Recycle']
serv_pivot

,commodity,Compost,Garbage,Recycle,total_yards,needed_recycle,needed_compost
cust,biz_type,,,,,,
98,MINI MART,0.00,4.00,16.00,20.00,16.00,NaN
218,WINERY,0.48,4.00,5.44,9.92,5.44,0.48
345,WINERY,0.00,4.00,0.00,4.00,NaN,NaN
567,MEDICAL,0.00,0.48,0.48,0.96,0.48,NaN
717,GROCERY,0.00,0.32,0.48,0.80,0.48,NaN
...,...,...,...,...,...,...,...
31644,MULTIFAMIL,0.96,0.96,0.96,2.88,0.96,0.96
31660,MIXED USE,0.48,0.48,0.48,1.44,0.48,0.48
31675,LODGING-FW,0.48,0.48,0.48,1.44,0.48,0.48
31676,WINERY,0.00,2.00,6.00,8.00,6.00,NaN
31679,WINERY,0.00,0.32,0.48,0.80,0.48,NaN

In [166]:
# Rename columns to have lower case
serv_pivot = serv_pivot.rename(columns={'Compost': 'compost', 'Garbage': 'garbage', 'Recycle': 'recycle'})
serv_pivot

,commodity,compost,garbage,recycle,total_yards,needed_recycle,needed_compost
cust,biz_type,,,,,,
98,MINI MART,0.00,4.00,16.00,20.00,16.00,NaN
218,WINERY,0.48,4.00,5.44,9.92,5.44,0.48
345,WINERY,0.00,4.00,0.00,4.00,NaN,NaN
567,MEDICAL,0.00,0.48,0.48,0.96,0.48,NaN
717,GROCERY,0.00,0.32,0.48,0.80,0.48,NaN
...,...,...,...,...,...,...,...
31644,MULTIFAMIL,0.96,0.96,0.96,2.88,0.96,0.96
31660,MIXED USE,0.48,0.48,0.48,1.44,0.48,0.48
31675,LODGING-FW,0.48,0.48,0.48,1.44,0.48,0.48
31676,WINERY,0.00,2.00,6.00,8.00,6.00,NaN
31679,WINERY,0.00,0.32,0.48,0.80,0.48,NaN

In [167]:
# Fix indexing issue
serv_pivot = serv_pivot.rename_axis(None, axis=1).reset_index()
serv_pivot.set_index('cust', inplace=True)
serv_pivot

,biz_type,compost,garbage,recycle,total_yards,needed_recycle,needed_compost
cust,,,,,,,
98,MINI MART,0.00,4.00,16.00,20.00,16.00,NaN
218,WINERY,0.48,4.00,5.44,9.92,5.44,0.48
345,WINERY,0.00,4.00,0.00,4.00,NaN,NaN
567,MEDICAL,0.00,0.48,0.48,0.96,0.48,NaN
717,GROCERY,0.00,0.32,0.48,0.80,0.48,NaN
...,...,...,...,...,...,...,...
31644,MULTIFAMIL,0.96,0.96,0.96,2.88,0.96,0.96
31660,MIXED USE,0.48,0.48,0.48,1.44,0.48,0.48
31675,LODGING-FW,0.48,0.48,0.48,1.44,0.48,0.48
31676,WINERY,0.00,2.00,6.00,8.00,6.00,NaN
31679,WINERY,0.00,0.32,0.48,0.80,0.48,NaN

In [168]:
# Create training df
train_df = serv_pivot.copy()
train_df.dropna(inplace=True)
train_df

,biz_type,compost,garbage,recycle,total_yards,needed_recycle,needed_compost
cust,,,,,,,
218,WINERY,0.48,4.00,5.44,9.92,5.44,0.48
767,WINERY,0.48,0.32,0.48,1.28,0.48,0.48
939,OFFICE BLD,1.44,0.96,0.48,2.88,0.48,1.44
1084,WINERY,0.48,16.00,5.44,21.92,5.44,0.48
1742,PRESCHOOL,0.48,0.16,0.48,1.12,0.48,0.48
...,...,...,...,...,...,...,...
31588,WINERY,0.48,0.48,0.96,1.92,0.96,0.48
31607,MULTIFAMIL,0.48,0.96,0.48,1.92,0.48,0.48
31644,MULTIFAMIL,0.96,0.96,0.96,2.88,0.96,0.96
31660,MIXED USE,0.48,0.48,0.48,1.44,0.48,0.48
31675,LODGING-FW,0.48,0.48,0.48,1.44,0.48,0.48

In [169]:
# Create testing df
test_df = serv_pivot.copy()
test_df = test_df[(test_df['recycle']== 0) |(test_df['compost']== 0)]
test_df

,biz_type,compost,garbage,recycle,total_yards,needed_recycle,needed_compost
cust,,,,,,,
98,MINI MART,0.0,4.00,16.00,20.00,16.00,NaN
345,WINERY,0.0,4.00,0.00,4.00,NaN,NaN
567,MEDICAL,0.0,0.48,0.48,0.96,0.48,NaN
717,GROCERY,0.0,0.32,0.48,0.80,0.48,NaN
800,WINERY,0.0,1.44,2.88,4.32,2.88,NaN
...,...,...,...,...,...,...,...
31364,OFFICE BLD,0.0,0.48,0.96,1.44,0.96,NaN
31591,LANDSCAPER,0.0,2.00,0.00,2.00,NaN,NaN
31593,CONTRACTOR,0.0,4.00,0.00,4.00,NaN,NaN
31676,WINERY,0.0,2.00,6.00,8.00,6.00,NaN
31679,WINERY,0.0,0.32,0.48,0.80,0.48,NaN

In [170]:
# Get a count of how many services are associated with each business type
serv_pivot['biz_type'].value_counts()

WINERY        129
MULTIFAMIL     43
OFFICE BLD     29
RESTAURANT     25
VINEYARD       23
LODGING        16
RETAIL         16
CHURCH         13
LODGING-FW     12
CONTRACTOR     12
MEDICAL        10
UTILITY         9
SCHOOL          9
GROCERY         8
COMMUNITY       8
AUTO            7
HOME IMPRO      6
MOBILEHOME      6
POSTOFFICE      5
MIXED USE       5
STRIP MALL      4
POLICEFIRE      4
MINI MART       3
PRESCHOOL       3
ENTERTAINM      3
DELI/CAFE       3
LANDSCAPER      3
HOSPITAL        3
FOURPLEX        3
HOA             3
BAKERY          3
PARK            2
NRSG HOME       2
INDUSTRIAL      2
BAR NO FW       2
DUPLEX          1
MEMBER          1
CATERING        1
FLORIST         1
GROUP HOME      1
Name: biz_type, dtype: int64

# Load Into postgreSQL Database in pgAdmin

In [171]:
# Create the path to your file directory and variables for the three files.
file_dir = 'C://Users/mabuc/Documents/Classwork/Final_Project/'

In [172]:
# Transform and load
db_string = f"postgresql://postgres:{db_password}@localhost:5432/Final_Project"
# Create engine
engine = create_engine(db_string)

In [173]:
# Import DataFrames to postgreSQL
merg_var_serv_com.to_sql(name='var_serv', if_exists='replace',con=engine)
merg_var_cust_com.to_sql(name = 'var_cust', if_exists='replace',con=engine)
serv_pivot.to_sql(name='commodity_table', if_exists= 'replace', con=engine)
test_df.to_sql(name='test_data', if_exists= 'replace', con=engine)
train_df.to_sql(name='train_data', if_exists= 'replace', con=engine)